{
  "data": [
    {
      "id": "home",
      "title": "Creative Coding Girls",
      "background": "video",
      "subtitle": "Workshops für Mädchen und Frauen",
      "teaser": "In den Creative Coding Girls Workshops entdecken Mädchen und Frauen auf kreative Weise die Welt des Programmierens. Egal ob Anfängerinnen oder Fortgeschrittene – die Workshops wecken Neugierde und kombinieren Kunst mit Informatik: Creativity meets Coding.",
      "video": "./media/coding-girls-s.webm",
      "links": [
        {
          "text": "Mehr erfahren",
          "url": "#workshops"
        },
        {
          "text": "Jetzt buchen",
          "url": "#contact"
        }
      ],
      "layout": "home"
    },
    {
      "id": "workshops",
      "title": "Workshops",
      "subtitle": "Kreativ programmieren lernen",
      "text": "Mädchen und Frauen brauchen weibliche Vorbilder in Technik und Inforamtik. Zudem trauen sie sich in einer rein weiblichen Gruppen eher, Fragen zu stellen und sich auszuprobieren. Aus diesem Grund biete ich Workshops an, die als Safe Space fungieren und speziell auf Mädchen und Frauen zugeschnitten sind. ",
      "technologie": "P5.JS",
      "layout": "page",
      "cssClasses": "has-grid is-layout-3",
      "image": "./images/coding-girls-setup.webp"
    },
    {
      "id": "workshop1",
      "title": "Beginner Workshop",
      "subtitle": "Der Workshop für Einsteigerinnen",
      "text": "Der Beginner Workshop richtet sich an Mädchen und Frauen, die noch keine Erfahrung im Programmieren haben. In einer einfachen Programmiersprachen lernen sie die Grundlagen des Programmierens kennen und erschaffen eigene abstrakte und interaktive Kunstwerke, die als Bilder abgespeichert und mit nach Hause genommen werden können. Vorkenntnisse sind nicht erforderlich.",
      "alter": "ab 14 Jahren",
      "preis": "Der Preis richtet sich nach der Anzahl der Teilnehmerinnen und der Dauer des Workshops. In einem persönlichen Gespräch erstelle ich Ihnen gerne ein individuelles Angebot.",
      "links":[
        {
          "text": "Jetzt Kontakt aufnehmen",
          "url": "#booking"
        }],
      "layout": "page",
      "cssClasses": "has-grid is-layout-1",
      "image": "./images/20221022-ITERATION-11.webp"
    },
    {
      "id": "workshop2",
      "title": "Advanced Workshop",
      "subtitle": "Der Workshop für Fortgeschrittene",
      "text": "Der Advanced Workshop richtet sich an Mädchen und Frauen, die bereits erste Erfahrungen mit dem Programmieren mit P5.JS gemacht haben. In diesem Workshop werden die Grundlagen vertieft und komplexere Konzepte wie Schleifen, Funktionen und Arrays erlernt. Die Teilnehmerinnen erschaffen eigene interaktive Kunstwerke, die ins Web exportiert und mit Freunden geteilt werden können.",
      "alter": "ab 14 Jahren",
      "preis": "Der Preis richtet sich nach der Anzahl der Teilnehmerinnen und der Dauer des Workshops. In einem persönlichen Gespräch erstelle ich Ihnen gerne ein individuelles Angebot.",
      "links":[
        {
          "text": "Jetzt Kontakt aufnehmen",
          "url": "#booking"
        }],
      "layout": "page",
      "cssClasses": "has-grid is-layout-2",
      "image": "./images/20221022-ITERATION-12.webp"
    },
    {
      "id": "workshop3",
      "title": "Master Workshop",
      "subtitle": "Der Workshop für Profis",
      "text": "Der Master Workshop richtet sich an Mädchen und Frauen, die bereits Erfahrung im Programmieren mit P5.JS haben und ihre Kenntnisse vertiefen möchten. In diesem Workshop werden fortgeschrittene Konzepte wie Objektorientierung, Klassen und Vererbung erlernt. Die Teilnehmerinnen erschaffen eigene interaktive Kunstwerke, die ins Web exportiert und mit Freunden geteilt werden können.",
      "preis": "Der Preis richtet sich nach der Anzahl der Teilnehmerinnen und der Dauer des Workshops.",
      "links":[
        {
          "text": "Jetzt Kontakt aufnehmen",
          "url": "#booking"
        }],
      "layout": "page",
      "cssClasses": "has-grid is-layout-3",
      "image": "./images/tech-f.webp"
    },
    {
      "id": "contact",
      "title": "Kontakt",
      "subtitle": "Jetzt Kontakt aufnehmen",
      "name:": "Sahrah El ghammaz",
      "email": "hallo@coding-girls.de",
      "about": "Hi, ich bin Sahrah. Ich bin Medieninformatikerin, angehende Medienpädagogin und Dozentin für Algorithmen und Programmierung. Ich liebe Kunst, Natur und Technik und möchte meine Begeisterung für das Programmieren an Mädchen und Frauen weitergeben. In meinen Workshops kombiniere ich Kunst mit Informatik und zeige, wie kreativ und vielfältig das Programmieren sein kann.",
      "text": "Sie haben Interesse an einem der Workshops? Kontaktieren Sie mich per E-Mail, in einem persönlichen Gespräch erstelle ich Ihnen gerne ein individuelles Angebot.",
      "image": "./images/usability-testing.jpg",
      "layout": "page",
      "cssClasses": "has-grid is-layout-text"
    },
    {
      "id": "quote-1",
      "layout": "quote",
      "quote": "sehr viel Geduld beim Erklären, verständliche Übungen, schöner Einblick in das Thema",
      "image": "./images/bg-stripes.svg"
    }
    ,
    {
      "id": "quote-2",
      "layout": "quote",
      "quote": "Ich habe mich sehr wohlgefühlt, vor allem auch Fragen zu stellen.",
      "image": "./images/moxd-lab-projektarbeit_DSC1122.jpg"
    }
  ]
}